results/factorial-final/security-overhead-final-plaintext-broker5/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf.log
run_id=security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3
producer_count=12
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-1.log -----
producer_index=1
producer_count=12
producer_records=8334
producer_throughput=84
1 records sent, 0.1 records/sec (0.01 MB/sec), 9070.0 ms avg latency, 9070.0 ms max latency.
212 records sent, 42.2 records/sec (4.12 MB/sec), 651.5 ms avg latency, 1969.0 ms max latency.
185 records sent, 37.0 records/sec (3.61 MB/sec), 162.5 ms avg latency, 525.0 ms max latency.
248 records sent, 49.3 records/sec (4.81 MB/sec), 115.0 ms avg latency, 384.0 ms max latency.
240 records sent, 47.9 records/sec (4.68 MB/sec), 78.9 ms avg latency, 216.0 ms max latency.
272 records sent, 54.2 records/sec (5.29 MB/sec), 70.3 ms avg latency, 226.0 ms max latency.
362 records sent, 72.0 records/sec (7.03 MB/sec), 45.2 ms avg latency, 210.0 ms max latency.
323 records sent, 64.1 records/sec (6.26 MB/sec), 36.2 ms avg latency, 136.0 ms max latency.
353 records sent, 70.1 records/sec (6.85 MB/sec), 55.8 ms avg latency, 241.0 ms max latency.
330 records sent, 65.4 records/sec (6.39 MB/sec), 44.3 ms avg latency, 206.0 ms max latency.
296 records sent, 59.0 records/sec (5.76 MB/sec), 45.3 ms avg latency, 189.0 ms max latency.
299 records sent, 59.5 records/sec (5.82 MB/sec), 46.2 ms avg latency, 292.0 ms max latency.
283 records sent, 56.5 records/sec (5.51 MB/sec), 46.4 ms avg latency, 253.0 ms max latency.
291 records sent, 57.6 records/sec (5.63 MB/sec), 43.3 ms avg latency, 152.0 ms max latency.
302 records sent, 60.2 records/sec (5.88 MB/sec), 46.3 ms avg latency, 231.0 ms max latency.
324 records sent, 64.2 records/sec (6.27 MB/sec), 45.8 ms avg latency, 221.0 ms max latency.
320 records sent, 63.9 records/sec (6.24 MB/sec), 57.7 ms avg latency, 303.0 ms max latency.
329 records sent, 65.6 records/sec (6.41 MB/sec), 41.2 ms avg latency, 189.0 ms max latency.
322 records sent, 64.1 records/sec (6.26 MB/sec), 44.9 ms avg latency, 299.0 ms max latency.
268 records sent, 53.3 records/sec (5.21 MB/sec), 46.3 ms avg latency, 229.0 ms max latency.
290 records sent, 57.9 records/sec (5.66 MB/sec), 40.1 ms avg latency, 204.0 ms max latency.
315 records sent, 62.5 records/sec (6.10 MB/sec), 33.0 ms avg latency, 125.0 ms max latency.
279 records sent, 55.7 records/sec (5.44 MB/sec), 41.4 ms avg latency, 183.0 ms max latency.
273 records sent, 54.5 records/sec (5.32 MB/sec), 54.7 ms avg latency, 204.0 ms max latency.
336 records sent, 67.1 records/sec (6.55 MB/sec), 41.3 ms avg latency, 177.0 ms max latency.
332 records sent, 66.0 records/sec (6.45 MB/sec), 34.3 ms avg latency, 148.0 ms max latency.
284 records sent, 56.6 records/sec (5.53 MB/sec), 39.9 ms avg latency, 155.0 ms max latency.
329 records sent, 65.7 records/sec (6.41 MB/sec), 36.6 ms avg latency, 124.0 ms max latency.
314 records sent, 62.7 records/sec (6.12 MB/sec), 37.3 ms avg latency, 204.0 ms max latency.
8334 records sent, 55.197171 records/sec (5.39 MB/sec), 67.05 ms avg latency, 9070.00 ms max latency, 36 ms 50th, 173 ms 95th, 771 ms 99th, 1552 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-2.log -----
producer_index=2
producer_count=12
producer_records=8334
producer_throughput=84
1 records sent, 0.1 records/sec (0.01 MB/sec), 10380.0 ms avg latency, 10380.0 ms max latency.
195 records sent, 38.9 records/sec (3.79 MB/sec), 826.1 ms avg latency, 1989.0 ms max latency.
247 records sent, 49.1 records/sec (4.80 MB/sec), 171.7 ms avg latency, 437.0 ms max latency.
225 records sent, 44.9 records/sec (4.38 MB/sec), 100.8 ms avg latency, 367.0 ms max latency.
274 records sent, 54.8 records/sec (5.35 MB/sec), 91.4 ms avg latency, 320.0 ms max latency.
309 records sent, 61.4 records/sec (6.00 MB/sec), 62.1 ms avg latency, 274.0 ms max latency.
338 records sent, 67.5 records/sec (6.60 MB/sec), 42.5 ms avg latency, 225.0 ms max latency.
354 records sent, 70.2 records/sec (6.86 MB/sec), 59.1 ms avg latency, 180.0 ms max latency.
344 records sent, 68.1 records/sec (6.65 MB/sec), 44.0 ms avg latency, 177.0 ms max latency.
383 records sent, 75.4 records/sec (7.36 MB/sec), 46.5 ms avg latency, 223.0 ms max latency.
268 records sent, 53.4 records/sec (5.21 MB/sec), 39.9 ms avg latency, 222.0 ms max latency.
218 records sent, 43.1 records/sec (4.21 MB/sec), 28.5 ms avg latency, 118.0 ms max latency.
198 records sent, 39.6 records/sec (3.87 MB/sec), 34.7 ms avg latency, 183.0 ms max latency.
207 records sent, 41.0 records/sec (4.00 MB/sec), 27.4 ms avg latency, 143.0 ms max latency.
272 records sent, 54.3 records/sec (5.30 MB/sec), 38.9 ms avg latency, 153.0 ms max latency.
288 records sent, 57.5 records/sec (5.62 MB/sec), 49.7 ms avg latency, 192.0 ms max latency.
282 records sent, 56.2 records/sec (5.49 MB/sec), 43.8 ms avg latency, 201.0 ms max latency.
318 records sent, 63.5 records/sec (6.20 MB/sec), 42.1 ms avg latency, 182.0 ms max latency.
279 records sent, 55.7 records/sec (5.44 MB/sec), 43.8 ms avg latency, 165.0 ms max latency.
287 records sent, 56.3 records/sec (5.49 MB/sec), 43.6 ms avg latency, 214.0 ms max latency.
298 records sent, 59.0 records/sec (5.76 MB/sec), 43.4 ms avg latency, 188.0 ms max latency.
309 records sent, 61.4 records/sec (5.99 MB/sec), 39.2 ms avg latency, 168.0 ms max latency.
298 records sent, 59.0 records/sec (5.76 MB/sec), 42.5 ms avg latency, 163.0 ms max latency.
290 records sent, 56.8 records/sec (5.55 MB/sec), 37.2 ms avg latency, 149.0 ms max latency.
278 records sent, 55.4 records/sec (5.41 MB/sec), 40.2 ms avg latency, 140.0 ms max latency.
312 records sent, 62.2 records/sec (6.07 MB/sec), 45.2 ms avg latency, 228.0 ms max latency.
309 records sent, 61.5 records/sec (6.01 MB/sec), 41.2 ms avg latency, 184.0 ms max latency.
294 records sent, 58.7 records/sec (5.73 MB/sec), 38.9 ms avg latency, 173.0 ms max latency.
332 records sent, 66.4 records/sec (6.48 MB/sec), 35.0 ms avg latency, 173.0 ms max latency.
8334 records sent, 54.538316 records/sec (5.33 MB/sec), 68.47 ms avg latency, 10380.00 ms max latency, 35 ms 50th, 167 ms 95th, 956 ms 99th, 1577 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-3.log -----
producer_index=3
producer_count=12
producer_records=8334
producer_throughput=84
1 records sent, 0.1 records/sec (0.01 MB/sec), 8519.0 ms avg latency, 8519.0 ms max latency.
224 records sent, 44.5 records/sec (4.34 MB/sec), 684.4 ms avg latency, 1952.0 ms max latency.
204 records sent, 40.1 records/sec (3.92 MB/sec), 170.9 ms avg latency, 471.0 ms max latency.
203 records sent, 40.6 records/sec (3.96 MB/sec), 99.3 ms avg latency, 236.0 ms max latency.
234 records sent, 46.6 records/sec (4.55 MB/sec), 83.3 ms avg latency, 236.0 ms max latency.
276 records sent, 54.6 records/sec (5.33 MB/sec), 73.9 ms avg latency, 228.0 ms max latency.
337 records sent, 67.1 records/sec (6.55 MB/sec), 51.0 ms avg latency, 182.0 ms max latency.
398 records sent, 78.9 records/sec (7.70 MB/sec), 34.5 ms avg latency, 111.0 ms max latency.
351 records sent, 69.8 records/sec (6.82 MB/sec), 42.2 ms avg latency, 145.0 ms max latency.
335 records sent, 66.5 records/sec (6.50 MB/sec), 44.3 ms avg latency, 169.0 ms max latency.
314 records sent, 62.0 records/sec (6.05 MB/sec), 35.0 ms avg latency, 144.0 ms max latency.
280 records sent, 55.5 records/sec (5.42 MB/sec), 47.4 ms avg latency, 235.0 ms max latency.
275 records sent, 54.6 records/sec (5.33 MB/sec), 41.3 ms avg latency, 216.0 ms max latency.
280 records sent, 55.9 records/sec (5.46 MB/sec), 41.9 ms avg latency, 208.0 ms max latency.
311 records sent, 62.2 records/sec (6.07 MB/sec), 53.3 ms avg latency, 293.0 ms max latency.
306 records sent, 60.5 records/sec (5.91 MB/sec), 41.1 ms avg latency, 155.0 ms max latency.
275 records sent, 54.9 records/sec (5.36 MB/sec), 38.6 ms avg latency, 131.0 ms max latency.
291 records sent, 57.9 records/sec (5.65 MB/sec), 38.8 ms avg latency, 151.0 ms max latency.
285 records sent, 56.9 records/sec (5.55 MB/sec), 45.3 ms avg latency, 204.0 ms max latency.
284 records sent, 55.9 records/sec (5.46 MB/sec), 53.4 ms avg latency, 280.0 ms max latency.
276 records sent, 55.2 records/sec (5.39 MB/sec), 47.3 ms avg latency, 226.0 ms max latency.
289 records sent, 57.4 records/sec (5.61 MB/sec), 39.1 ms avg latency, 204.0 ms max latency.
306 records sent, 60.8 records/sec (5.94 MB/sec), 39.8 ms avg latency, 165.0 ms max latency.
286 records sent, 56.8 records/sec (5.55 MB/sec), 33.9 ms avg latency, 177.0 ms max latency.
317 records sent, 63.3 records/sec (6.18 MB/sec), 41.6 ms avg latency, 206.0 ms max latency.
306 records sent, 59.4 records/sec (5.80 MB/sec), 33.5 ms avg latency, 214.0 ms max latency.
332 records sent, 66.3 records/sec (6.48 MB/sec), 38.0 ms avg latency, 285.0 ms max latency.
298 records sent, 59.2 records/sec (5.78 MB/sec), 27.3 ms avg latency, 104.0 ms max latency.
307 records sent, 60.8 records/sec (5.94 MB/sec), 31.7 ms avg latency, 146.0 ms max latency.
8334 records sent, 54.670331 records/sec (5.34 MB/sec), 65.83 ms avg latency, 8519.00 ms max latency, 34 ms 50th, 168 ms 95th, 807 ms 99th, 1555 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-4.log -----
producer_index=4
producer_count=12
producer_records=8334
producer_throughput=84
1 records sent, 0.1 records/sec (0.01 MB/sec), 8791.0 ms avg latency, 8791.0 ms max latency.
203 records sent, 40.0 records/sec (3.91 MB/sec), 1011.2 ms avg latency, 2019.0 ms max latency.
225 records sent, 44.8 records/sec (4.37 MB/sec), 230.1 ms avg latency, 635.0 ms max latency.
223 records sent, 44.3 records/sec (4.33 MB/sec), 117.9 ms avg latency, 355.0 ms max latency.
252 records sent, 49.8 records/sec (4.87 MB/sec), 73.7 ms avg latency, 324.0 ms max latency.
274 records sent, 54.6 records/sec (5.33 MB/sec), 61.1 ms avg latency, 235.0 ms max latency.
359 records sent, 71.7 records/sec (7.00 MB/sec), 30.6 ms avg latency, 169.0 ms max latency.
340 records sent, 67.9 records/sec (6.63 MB/sec), 41.2 ms avg latency, 158.0 ms max latency.
338 records sent, 66.5 records/sec (6.49 MB/sec), 35.7 ms avg latency, 210.0 ms max latency.
315 records sent, 62.3 records/sec (6.09 MB/sec), 40.7 ms avg latency, 140.0 ms max latency.
312 records sent, 62.4 records/sec (6.09 MB/sec), 36.5 ms avg latency, 173.0 ms max latency.
322 records sent, 64.2 records/sec (6.27 MB/sec), 44.8 ms avg latency, 186.0 ms max latency.
297 records sent, 59.3 records/sec (5.79 MB/sec), 44.2 ms avg latency, 182.0 ms max latency.
311 records sent, 62.2 records/sec (6.07 MB/sec), 43.3 ms avg latency, 137.0 ms max latency.
281 records sent, 56.2 records/sec (5.49 MB/sec), 46.0 ms avg latency, 211.0 ms max latency.
290 records sent, 58.0 records/sec (5.66 MB/sec), 40.1 ms avg latency, 216.0 ms max latency.
314 records sent, 62.7 records/sec (6.12 MB/sec), 41.0 ms avg latency, 123.0 ms max latency.
282 records sent, 56.3 records/sec (5.50 MB/sec), 55.5 ms avg latency, 191.0 ms max latency.
288 records sent, 57.0 records/sec (5.57 MB/sec), 42.7 ms avg latency, 171.0 ms max latency.
335 records sent, 65.8 records/sec (6.42 MB/sec), 62.3 ms avg latency, 245.0 ms max latency.
328 records sent, 65.3 records/sec (6.37 MB/sec), 55.3 ms avg latency, 345.0 ms max latency.
293 records sent, 58.4 records/sec (5.70 MB/sec), 39.5 ms avg latency, 237.0 ms max latency.
282 records sent, 55.8 records/sec (5.45 MB/sec), 41.2 ms avg latency, 170.0 ms max latency.
315 records sent, 62.7 records/sec (6.12 MB/sec), 37.8 ms avg latency, 148.0 ms max latency.
271 records sent, 54.1 records/sec (5.28 MB/sec), 48.8 ms avg latency, 266.0 ms max latency.
298 records sent, 58.2 records/sec (5.69 MB/sec), 41.0 ms avg latency, 177.0 ms max latency.
337 records sent, 67.1 records/sec (6.55 MB/sec), 41.6 ms avg latency, 207.0 ms max latency.
292 records sent, 58.2 records/sec (5.69 MB/sec), 34.1 ms avg latency, 149.0 ms max latency.
286 records sent, 56.8 records/sec (5.55 MB/sec), 38.8 ms avg latency, 184.0 ms max latency.
8334 records sent, 54.923980 records/sec (5.36 MB/sec), 75.88 ms avg latency, 8791.00 ms max latency, 36 ms 50th, 191 ms 95th, 1156 ms 99th, 1860 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-5.log -----
producer_index=5
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 9986.0 ms avg latency, 9986.0 ms max latency.
206 records sent, 40.8 records/sec (3.98 MB/sec), 775.9 ms avg latency, 2120.0 ms max latency.
220 records sent, 43.5 records/sec (4.25 MB/sec), 233.3 ms avg latency, 671.0 ms max latency.
213 records sent, 41.4 records/sec (4.04 MB/sec), 99.9 ms avg latency, 284.0 ms max latency.
264 records sent, 52.6 records/sec (5.14 MB/sec), 102.0 ms avg latency, 361.0 ms max latency.
277 records sent, 55.0 records/sec (5.37 MB/sec), 66.4 ms avg latency, 236.0 ms max latency.
341 records sent, 68.2 records/sec (6.66 MB/sec), 81.6 ms avg latency, 553.0 ms max latency.
358 records sent, 71.3 records/sec (6.96 MB/sec), 44.6 ms avg latency, 181.0 ms max latency.
319 records sent, 63.7 records/sec (6.22 MB/sec), 46.9 ms avg latency, 150.0 ms max latency.
334 records sent, 66.3 records/sec (6.48 MB/sec), 43.3 ms avg latency, 187.0 ms max latency.
317 records sent, 63.3 records/sec (6.18 MB/sec), 50.4 ms avg latency, 214.0 ms max latency.
278 records sent, 55.2 records/sec (5.39 MB/sec), 43.9 ms avg latency, 226.0 ms max latency.
285 records sent, 56.5 records/sec (5.52 MB/sec), 50.1 ms avg latency, 281.0 ms max latency.
296 records sent, 58.5 records/sec (5.72 MB/sec), 41.6 ms avg latency, 211.0 ms max latency.
298 records sent, 59.3 records/sec (5.79 MB/sec), 42.5 ms avg latency, 217.0 ms max latency.
291 records sent, 57.8 records/sec (5.65 MB/sec), 35.6 ms avg latency, 197.0 ms max latency.
293 records sent, 58.0 records/sec (5.66 MB/sec), 37.2 ms avg latency, 142.0 ms max latency.
289 records sent, 56.8 records/sec (5.54 MB/sec), 53.4 ms avg latency, 222.0 ms max latency.
277 records sent, 54.4 records/sec (5.31 MB/sec), 44.2 ms avg latency, 229.0 ms max latency.
289 records sent, 57.4 records/sec (5.61 MB/sec), 51.8 ms avg latency, 212.0 ms max latency.
298 records sent, 59.4 records/sec (5.81 MB/sec), 43.5 ms avg latency, 186.0 ms max latency.
313 records sent, 61.4 records/sec (5.99 MB/sec), 52.2 ms avg latency, 286.0 ms max latency.
304 records sent, 60.8 records/sec (5.94 MB/sec), 39.6 ms avg latency, 179.0 ms max latency.
286 records sent, 57.2 records/sec (5.58 MB/sec), 39.9 ms avg latency, 171.0 ms max latency.
293 records sent, 58.5 records/sec (5.71 MB/sec), 47.4 ms avg latency, 172.0 ms max latency.
318 records sent, 63.0 records/sec (6.15 MB/sec), 42.6 ms avg latency, 232.0 ms max latency.
305 records sent, 61.0 records/sec (5.96 MB/sec), 42.0 ms avg latency, 149.0 ms max latency.
303 records sent, 60.3 records/sec (5.89 MB/sec), 33.9 ms avg latency, 113.0 ms max latency.
345 records sent, 68.3 records/sec (6.67 MB/sec), 55.2 ms avg latency, 215.0 ms max latency.
8333 records sent, 54.296903 records/sec (5.30 MB/sec), 74.54 ms avg latency, 9986.00 ms max latency, 37 ms 50th, 202 ms 95th, 838 ms 99th, 1815 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-6.log -----
producer_index=6
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 9453.0 ms avg latency, 9453.0 ms max latency.
226 records sent, 45.0 records/sec (4.40 MB/sec), 1055.5 ms avg latency, 2356.0 ms max latency.
192 records sent, 38.1 records/sec (3.72 MB/sec), 138.8 ms avg latency, 375.0 ms max latency.
234 records sent, 45.8 records/sec (4.47 MB/sec), 148.3 ms avg latency, 426.0 ms max latency.
282 records sent, 55.6 records/sec (5.43 MB/sec), 75.5 ms avg latency, 247.0 ms max latency.
302 records sent, 60.0 records/sec (5.86 MB/sec), 86.5 ms avg latency, 358.0 ms max latency.
343 records sent, 68.6 records/sec (6.70 MB/sec), 52.7 ms avg latency, 178.0 ms max latency.
352 records sent, 70.3 records/sec (6.87 MB/sec), 39.1 ms avg latency, 158.0 ms max latency.
346 records sent, 68.7 records/sec (6.71 MB/sec), 34.7 ms avg latency, 144.0 ms max latency.
293 records sent, 58.4 records/sec (5.71 MB/sec), 35.3 ms avg latency, 163.0 ms max latency.
311 records sent, 62.0 records/sec (6.06 MB/sec), 44.7 ms avg latency, 154.0 ms max latency.
320 records sent, 63.7 records/sec (6.22 MB/sec), 63.4 ms avg latency, 319.0 ms max latency.
298 records sent, 58.6 records/sec (5.72 MB/sec), 41.1 ms avg latency, 189.0 ms max latency.
309 records sent, 61.6 records/sec (6.02 MB/sec), 45.8 ms avg latency, 182.0 ms max latency.
289 records sent, 57.8 records/sec (5.64 MB/sec), 59.3 ms avg latency, 241.0 ms max latency.
282 records sent, 55.9 records/sec (5.46 MB/sec), 46.7 ms avg latency, 224.0 ms max latency.
291 records sent, 57.8 records/sec (5.64 MB/sec), 45.9 ms avg latency, 211.0 ms max latency.
271 records sent, 54.0 records/sec (5.28 MB/sec), 46.9 ms avg latency, 212.0 ms max latency.
314 records sent, 62.7 records/sec (6.13 MB/sec), 42.1 ms avg latency, 171.0 ms max latency.
298 records sent, 59.2 records/sec (5.78 MB/sec), 43.9 ms avg latency, 216.0 ms max latency.
289 records sent, 57.5 records/sec (5.62 MB/sec), 54.2 ms avg latency, 240.0 ms max latency.
284 records sent, 56.0 records/sec (5.47 MB/sec), 43.5 ms avg latency, 242.0 ms max latency.
276 records sent, 54.5 records/sec (5.32 MB/sec), 40.6 ms avg latency, 225.0 ms max latency.
297 records sent, 59.4 records/sec (5.80 MB/sec), 42.6 ms avg latency, 216.0 ms max latency.
276 records sent, 55.2 records/sec (5.39 MB/sec), 49.7 ms avg latency, 228.0 ms max latency.
318 records sent, 63.2 records/sec (6.17 MB/sec), 34.8 ms avg latency, 170.0 ms max latency.
330 records sent, 65.4 records/sec (6.39 MB/sec), 38.5 ms avg latency, 156.0 ms max latency.
312 records sent, 61.9 records/sec (6.05 MB/sec), 46.4 ms avg latency, 255.0 ms max latency.
338 records sent, 67.4 records/sec (6.58 MB/sec), 44.7 ms avg latency, 166.0 ms max latency.
8333 records sent, 54.673096 records/sec (5.34 MB/sec), 81.08 ms avg latency, 9453.00 ms max latency, 37 ms 50th, 191 ms 95th, 1292 ms 99th, 2054 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-7.log -----
producer_index=7
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 1475.0 ms avg latency, 1475.0 ms max latency.
220 records sent, 43.9 records/sec (4.28 MB/sec), 747.1 ms avg latency, 9541.0 ms max latency.
225 records sent, 44.7 records/sec (4.37 MB/sec), 213.8 ms avg latency, 539.0 ms max latency.
219 records sent, 43.8 records/sec (4.27 MB/sec), 97.2 ms avg latency, 268.0 ms max latency.
260 records sent, 52.0 records/sec (5.08 MB/sec), 70.7 ms avg latency, 243.0 ms max latency.
328 records sent, 64.9 records/sec (6.34 MB/sec), 86.4 ms avg latency, 315.0 ms max latency.
390 records sent, 77.6 records/sec (7.58 MB/sec), 65.8 ms avg latency, 318.0 ms max latency.
382 records sent, 76.1 records/sec (7.43 MB/sec), 36.5 ms avg latency, 143.0 ms max latency.
361 records sent, 72.1 records/sec (7.04 MB/sec), 36.3 ms avg latency, 131.0 ms max latency.
390 records sent, 78.0 records/sec (7.62 MB/sec), 52.8 ms avg latency, 218.0 ms max latency.
278 records sent, 55.4 records/sec (5.41 MB/sec), 43.7 ms avg latency, 141.0 ms max latency.
289 records sent, 57.8 records/sec (5.64 MB/sec), 45.9 ms avg latency, 174.0 ms max latency.
292 records sent, 58.3 records/sec (5.69 MB/sec), 49.7 ms avg latency, 213.0 ms max latency.
270 records sent, 53.7 records/sec (5.24 MB/sec), 44.7 ms avg latency, 182.0 ms max latency.
277 records sent, 55.3 records/sec (5.40 MB/sec), 56.8 ms avg latency, 261.0 ms max latency.
339 records sent, 67.3 records/sec (6.58 MB/sec), 55.7 ms avg latency, 265.0 ms max latency.
304 records sent, 59.6 records/sec (5.82 MB/sec), 37.2 ms avg latency, 160.0 ms max latency.
316 records sent, 62.2 records/sec (6.08 MB/sec), 38.8 ms avg latency, 165.0 ms max latency.
279 records sent, 55.6 records/sec (5.43 MB/sec), 39.0 ms avg latency, 230.0 ms max latency.
298 records sent, 59.4 records/sec (5.81 MB/sec), 53.1 ms avg latency, 223.0 ms max latency.
300 records sent, 59.4 records/sec (5.80 MB/sec), 48.6 ms avg latency, 215.0 ms max latency.
325 records sent, 64.2 records/sec (6.26 MB/sec), 35.1 ms avg latency, 144.0 ms max latency.
329 records sent, 65.5 records/sec (6.40 MB/sec), 42.3 ms avg latency, 177.0 ms max latency.
303 records sent, 60.4 records/sec (5.90 MB/sec), 56.8 ms avg latency, 246.0 ms max latency.
333 records sent, 66.3 records/sec (6.48 MB/sec), 46.1 ms avg latency, 195.0 ms max latency.
313 records sent, 62.4 records/sec (6.09 MB/sec), 38.8 ms avg latency, 247.0 ms max latency.
325 records sent, 64.8 records/sec (6.33 MB/sec), 35.7 ms avg latency, 169.0 ms max latency.
293 records sent, 57.7 records/sec (5.64 MB/sec), 36.8 ms avg latency, 214.0 ms max latency.
8333 records sent, 56.451285 records/sec (5.51 MB/sec), 72.21 ms avg latency, 9541.00 ms max latency, 37 ms 50th, 196 ms 95th, 889 ms 99th, 1716 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-8.log -----
producer_index=8
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 9757.0 ms avg latency, 9757.0 ms max latency.
202 records sent, 40.1 records/sec (3.92 MB/sec), 641.0 ms avg latency, 2025.0 ms max latency.
208 records sent, 41.4 records/sec (4.04 MB/sec), 158.8 ms avg latency, 446.0 ms max latency.
222 records sent, 44.1 records/sec (4.31 MB/sec), 107.0 ms avg latency, 407.0 ms max latency.
252 records sent, 49.2 records/sec (4.80 MB/sec), 88.1 ms avg latency, 272.0 ms max latency.
288 records sent, 57.5 records/sec (5.62 MB/sec), 58.0 ms avg latency, 275.0 ms max latency.
357 records sent, 71.3 records/sec (6.97 MB/sec), 35.4 ms avg latency, 125.0 ms max latency.
328 records sent, 65.6 records/sec (6.40 MB/sec), 40.4 ms avg latency, 314.0 ms max latency.
329 records sent, 65.8 records/sec (6.42 MB/sec), 43.2 ms avg latency, 184.0 ms max latency.
343 records sent, 68.5 records/sec (6.69 MB/sec), 56.4 ms avg latency, 294.0 ms max latency.
309 records sent, 61.5 records/sec (6.01 MB/sec), 46.0 ms avg latency, 213.0 ms max latency.
283 records sent, 55.9 records/sec (5.46 MB/sec), 43.2 ms avg latency, 253.0 ms max latency.
315 records sent, 62.8 records/sec (6.13 MB/sec), 47.3 ms avg latency, 224.0 ms max latency.
276 records sent, 55.1 records/sec (5.38 MB/sec), 51.2 ms avg latency, 159.0 ms max latency.
316 records sent, 63.1 records/sec (6.16 MB/sec), 46.2 ms avg latency, 201.0 ms max latency.
293 records sent, 58.6 records/sec (5.72 MB/sec), 40.0 ms avg latency, 268.0 ms max latency.
299 records sent, 59.4 records/sec (5.80 MB/sec), 39.6 ms avg latency, 147.0 ms max latency.
309 records sent, 61.0 records/sec (5.96 MB/sec), 48.7 ms avg latency, 164.0 ms max latency.
306 records sent, 61.1 records/sec (5.97 MB/sec), 39.5 ms avg latency, 194.0 ms max latency.
309 records sent, 61.8 records/sec (6.04 MB/sec), 51.7 ms avg latency, 258.0 ms max latency.
310 records sent, 61.2 records/sec (5.97 MB/sec), 54.2 ms avg latency, 315.0 ms max latency.
310 records sent, 61.8 records/sec (6.04 MB/sec), 44.2 ms avg latency, 235.0 ms max latency.
336 records sent, 66.4 records/sec (6.48 MB/sec), 51.1 ms avg latency, 185.0 ms max latency.
333 records sent, 66.6 records/sec (6.50 MB/sec), 57.1 ms avg latency, 258.0 ms max latency.
313 records sent, 61.8 records/sec (6.03 MB/sec), 34.8 ms avg latency, 156.0 ms max latency.
290 records sent, 57.7 records/sec (5.64 MB/sec), 38.4 ms avg latency, 219.0 ms max latency.
309 records sent, 59.6 records/sec (5.82 MB/sec), 39.1 ms avg latency, 185.0 ms max latency.
310 records sent, 61.8 records/sec (6.03 MB/sec), 34.6 ms avg latency, 202.0 ms max latency.
8333 records sent, 55.157669 records/sec (5.39 MB/sec), 66.39 ms avg latency, 9757.00 ms max latency, 36 ms 50th, 182 ms 95th, 603 ms 99th, 1616 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-9.log -----
producer_index=9
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 8910.0 ms avg latency, 8910.0 ms max latency.
212 records sent, 41.8 records/sec (4.09 MB/sec), 588.0 ms avg latency, 1692.0 ms max latency.
231 records sent, 45.3 records/sec (4.43 MB/sec), 178.5 ms avg latency, 443.0 ms max latency.
247 records sent, 49.3 records/sec (4.82 MB/sec), 132.6 ms avg latency, 491.0 ms max latency.
258 records sent, 51.3 records/sec (5.01 MB/sec), 62.3 ms avg latency, 168.0 ms max latency.
283 records sent, 56.6 records/sec (5.53 MB/sec), 55.5 ms avg latency, 185.0 ms max latency.
327 records sent, 65.2 records/sec (6.36 MB/sec), 43.4 ms avg latency, 163.0 ms max latency.
360 records sent, 71.9 records/sec (7.02 MB/sec), 42.4 ms avg latency, 165.0 ms max latency.
359 records sent, 71.5 records/sec (6.98 MB/sec), 53.7 ms avg latency, 238.0 ms max latency.
341 records sent, 67.3 records/sec (6.57 MB/sec), 38.6 ms avg latency, 174.0 ms max latency.
325 records sent, 65.0 records/sec (6.35 MB/sec), 42.8 ms avg latency, 225.0 ms max latency.
338 records sent, 67.3 records/sec (6.58 MB/sec), 46.2 ms avg latency, 170.0 ms max latency.
292 records sent, 57.8 records/sec (5.65 MB/sec), 51.0 ms avg latency, 199.0 ms max latency.
285 records sent, 57.0 records/sec (5.57 MB/sec), 46.4 ms avg latency, 216.0 ms max latency.
306 records sent, 60.5 records/sec (5.91 MB/sec), 36.7 ms avg latency, 200.0 ms max latency.
313 records sent, 62.2 records/sec (6.08 MB/sec), 47.9 ms avg latency, 261.0 ms max latency.
265 records sent, 53.0 records/sec (5.17 MB/sec), 37.5 ms avg latency, 198.0 ms max latency.
267 records sent, 52.7 records/sec (5.15 MB/sec), 47.2 ms avg latency, 191.0 ms max latency.
290 records sent, 57.9 records/sec (5.65 MB/sec), 38.2 ms avg latency, 219.0 ms max latency.
283 records sent, 56.2 records/sec (5.49 MB/sec), 39.5 ms avg latency, 175.0 ms max latency.
292 records sent, 58.1 records/sec (5.67 MB/sec), 47.1 ms avg latency, 244.0 ms max latency.
299 records sent, 59.0 records/sec (5.77 MB/sec), 38.2 ms avg latency, 182.0 ms max latency.
284 records sent, 56.5 records/sec (5.52 MB/sec), 40.2 ms avg latency, 267.0 ms max latency.
297 records sent, 59.4 records/sec (5.80 MB/sec), 40.5 ms avg latency, 197.0 ms max latency.
281 records sent, 56.0 records/sec (5.46 MB/sec), 36.7 ms avg latency, 194.0 ms max latency.
305 records sent, 61.0 records/sec (5.96 MB/sec), 33.4 ms avg latency, 144.0 ms max latency.
295 records sent, 58.4 records/sec (5.70 MB/sec), 44.8 ms avg latency, 216.0 ms max latency.
356 records sent, 70.8 records/sec (6.92 MB/sec), 45.6 ms avg latency, 159.0 ms max latency.
332 records sent, 64.4 records/sec (6.29 MB/sec), 44.6 ms avg latency, 187.0 ms max latency.
8333 records sent, 55.098951 records/sec (5.38 MB/sec), 65.32 ms avg latency, 8910.00 ms max latency, 36 ms 50th, 165 ms 95th, 705 ms 99th, 1494 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-10.log -----
producer_index=10
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 9538.0 ms avg latency, 9538.0 ms max latency.
212 records sent, 42.3 records/sec (4.13 MB/sec), 679.8 ms avg latency, 1857.0 ms max latency.
186 records sent, 37.1 records/sec (3.62 MB/sec), 130.5 ms avg latency, 347.0 ms max latency.
252 records sent, 50.1 records/sec (4.89 MB/sec), 128.0 ms avg latency, 574.0 ms max latency.
249 records sent, 49.8 records/sec (4.86 MB/sec), 118.5 ms avg latency, 435.0 ms max latency.
296 records sent, 58.3 records/sec (5.69 MB/sec), 51.8 ms avg latency, 201.0 ms max latency.
328 records sent, 65.5 records/sec (6.39 MB/sec), 44.4 ms avg latency, 172.0 ms max latency.
359 records sent, 71.6 records/sec (6.99 MB/sec), 42.3 ms avg latency, 169.0 ms max latency.
332 records sent, 66.2 records/sec (6.46 MB/sec), 47.0 ms avg latency, 174.0 ms max latency.
318 records sent, 63.3 records/sec (6.19 MB/sec), 54.2 ms avg latency, 261.0 ms max latency.
281 records sent, 56.0 records/sec (5.47 MB/sec), 42.6 ms avg latency, 134.0 ms max latency.
276 records sent, 55.2 records/sec (5.39 MB/sec), 37.5 ms avg latency, 215.0 ms max latency.
264 records sent, 52.5 records/sec (5.13 MB/sec), 42.5 ms avg latency, 199.0 ms max latency.
319 records sent, 63.5 records/sec (6.20 MB/sec), 49.1 ms avg latency, 234.0 ms max latency.
305 records sent, 60.8 records/sec (5.94 MB/sec), 51.5 ms avg latency, 205.0 ms max latency.
296 records sent, 59.2 records/sec (5.78 MB/sec), 46.4 ms avg latency, 283.0 ms max latency.
289 records sent, 57.5 records/sec (5.61 MB/sec), 55.1 ms avg latency, 206.0 ms max latency.
284 records sent, 56.8 records/sec (5.54 MB/sec), 48.2 ms avg latency, 162.0 ms max latency.
314 records sent, 62.3 records/sec (6.09 MB/sec), 46.3 ms avg latency, 193.0 ms max latency.
293 records sent, 57.9 records/sec (5.65 MB/sec), 47.6 ms avg latency, 216.0 ms max latency.
277 records sent, 55.0 records/sec (5.37 MB/sec), 55.3 ms avg latency, 263.0 ms max latency.
295 records sent, 58.7 records/sec (5.73 MB/sec), 38.0 ms avg latency, 184.0 ms max latency.
276 records sent, 54.7 records/sec (5.34 MB/sec), 45.4 ms avg latency, 215.0 ms max latency.
307 records sent, 61.3 records/sec (5.98 MB/sec), 35.1 ms avg latency, 95.0 ms max latency.
302 records sent, 60.1 records/sec (5.87 MB/sec), 34.8 ms avg latency, 185.0 ms max latency.
329 records sent, 65.6 records/sec (6.40 MB/sec), 42.0 ms avg latency, 228.0 ms max latency.
288 records sent, 57.5 records/sec (5.62 MB/sec), 35.3 ms avg latency, 160.0 ms max latency.
324 records sent, 64.4 records/sec (6.29 MB/sec), 39.8 ms avg latency, 201.0 ms max latency.
299 records sent, 59.7 records/sec (5.83 MB/sec), 28.7 ms avg latency, 185.0 ms max latency.
8333 records sent, 54.689961 records/sec (5.34 MB/sec), 67.78 ms avg latency, 9538.00 ms max latency, 36 ms 50th, 164 ms 95th, 840 ms 99th, 1634 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-11.log -----
producer_index=11
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 9173.0 ms avg latency, 9173.0 ms max latency.
200 records sent, 38.0 records/sec (3.71 MB/sec), 963.9 ms avg latency, 1786.0 ms max latency.
217 records sent, 42.9 records/sec (4.19 MB/sec), 216.0 ms avg latency, 760.0 ms max latency.
209 records sent, 41.6 records/sec (4.06 MB/sec), 129.4 ms avg latency, 353.0 ms max latency.
286 records sent, 57.0 records/sec (5.56 MB/sec), 95.1 ms avg latency, 289.0 ms max latency.
289 records sent, 57.0 records/sec (5.57 MB/sec), 64.0 ms avg latency, 321.0 ms max latency.
340 records sent, 67.4 records/sec (6.58 MB/sec), 40.4 ms avg latency, 172.0 ms max latency.
346 records sent, 69.0 records/sec (6.74 MB/sec), 36.5 ms avg latency, 258.0 ms max latency.
311 records sent, 61.9 records/sec (6.05 MB/sec), 36.3 ms avg latency, 117.0 ms max latency.
333 records sent, 66.2 records/sec (6.46 MB/sec), 37.0 ms avg latency, 163.0 ms max latency.
307 records sent, 60.5 records/sec (5.91 MB/sec), 50.6 ms avg latency, 206.0 ms max latency.
290 records sent, 57.3 records/sec (5.60 MB/sec), 39.5 ms avg latency, 185.0 ms max latency.
305 records sent, 60.8 records/sec (5.94 MB/sec), 58.0 ms avg latency, 297.0 ms max latency.
296 records sent, 58.9 records/sec (5.75 MB/sec), 41.3 ms avg latency, 191.0 ms max latency.
329 records sent, 65.4 records/sec (6.38 MB/sec), 44.1 ms avg latency, 208.0 ms max latency.
324 records sent, 64.7 records/sec (6.32 MB/sec), 41.3 ms avg latency, 159.0 ms max latency.
281 records sent, 55.9 records/sec (5.46 MB/sec), 41.2 ms avg latency, 209.0 ms max latency.
262 records sent, 51.8 records/sec (5.06 MB/sec), 43.0 ms avg latency, 142.0 ms max latency.
277 records sent, 55.1 records/sec (5.38 MB/sec), 40.9 ms avg latency, 232.0 ms max latency.
314 records sent, 62.0 records/sec (6.06 MB/sec), 65.1 ms avg latency, 232.0 ms max latency.
322 records sent, 64.3 records/sec (6.28 MB/sec), 53.0 ms avg latency, 214.0 ms max latency.
298 records sent, 59.1 records/sec (5.77 MB/sec), 34.3 ms avg latency, 165.0 ms max latency.
306 records sent, 61.2 records/sec (5.98 MB/sec), 43.9 ms avg latency, 174.0 ms max latency.
320 records sent, 63.7 records/sec (6.22 MB/sec), 38.3 ms avg latency, 227.0 ms max latency.
318 records sent, 62.6 records/sec (6.12 MB/sec), 40.1 ms avg latency, 183.0 ms max latency.
314 records sent, 61.5 records/sec (6.01 MB/sec), 35.9 ms avg latency, 212.0 ms max latency.
291 records sent, 57.8 records/sec (5.65 MB/sec), 40.8 ms avg latency, 203.0 ms max latency.
313 records sent, 62.5 records/sec (6.10 MB/sec), 37.1 ms avg latency, 189.0 ms max latency.
299 records sent, 59.5 records/sec (5.81 MB/sec), 35.7 ms avg latency, 198.0 ms max latency.
8333 records sent, 54.870019 records/sec (5.36 MB/sec), 74.73 ms avg latency, 9173.00 ms max latency, 34 ms 50th, 192 ms 95th, 1031 ms 99th, 1636 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-plaintext-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod12-complz4-trial3/producer-perf-12.log -----
producer_index=12
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 9574.0 ms avg latency, 9574.0 ms max latency.
206 records sent, 39.3 records/sec (3.83 MB/sec), 1146.6 ms avg latency, 2213.0 ms max latency.
211 records sent, 42.2 records/sec (4.12 MB/sec), 274.7 ms avg latency, 923.0 ms max latency.
241 records sent, 48.2 records/sec (4.70 MB/sec), 120.3 ms avg latency, 455.0 ms max latency.
231 records sent, 45.4 records/sec (4.43 MB/sec), 83.0 ms avg latency, 262.0 ms max latency.
275 records sent, 54.8 records/sec (5.35 MB/sec), 66.9 ms avg latency, 230.0 ms max latency.
327 records sent, 65.2 records/sec (6.36 MB/sec), 49.1 ms avg latency, 215.0 ms max latency.
360 records sent, 71.9 records/sec (7.02 MB/sec), 40.4 ms avg latency, 222.0 ms max latency.
351 records sent, 69.7 records/sec (6.81 MB/sec), 42.7 ms avg latency, 171.0 ms max latency.
342 records sent, 68.3 records/sec (6.67 MB/sec), 53.7 ms avg latency, 291.0 ms max latency.
297 records sent, 59.3 records/sec (5.79 MB/sec), 41.1 ms avg latency, 233.0 ms max latency.
286 records sent, 57.1 records/sec (5.58 MB/sec), 40.6 ms avg latency, 286.0 ms max latency.
342 records sent, 67.3 records/sec (6.57 MB/sec), 64.2 ms avg latency, 180.0 ms max latency.
308 records sent, 61.3 records/sec (5.98 MB/sec), 45.6 ms avg latency, 238.0 ms max latency.
333 records sent, 66.2 records/sec (6.47 MB/sec), 47.5 ms avg latency, 208.0 ms max latency.
292 records sent, 58.1 records/sec (5.68 MB/sec), 45.7 ms avg latency, 231.0 ms max latency.
309 records sent, 61.7 records/sec (6.02 MB/sec), 51.0 ms avg latency, 212.0 ms max latency.
316 records sent, 63.0 records/sec (6.16 MB/sec), 41.4 ms avg latency, 149.0 ms max latency.
325 records sent, 64.6 records/sec (6.31 MB/sec), 39.1 ms avg latency, 158.0 ms max latency.
266 records sent, 53.1 records/sec (5.18 MB/sec), 41.8 ms avg latency, 289.0 ms max latency.
286 records sent, 57.0 records/sec (5.56 MB/sec), 38.7 ms avg latency, 154.0 ms max latency.
295 records sent, 58.9 records/sec (5.75 MB/sec), 32.5 ms avg latency, 157.0 ms max latency.
289 records sent, 57.7 records/sec (5.64 MB/sec), 41.3 ms avg latency, 218.0 ms max latency.
288 records sent, 57.1 records/sec (5.58 MB/sec), 45.4 ms avg latency, 192.0 ms max latency.
291 records sent, 57.7 records/sec (5.64 MB/sec), 33.6 ms avg latency, 201.0 ms max latency.
331 records sent, 63.9 records/sec (6.24 MB/sec), 34.1 ms avg latency, 128.0 ms max latency.
322 records sent, 64.2 records/sec (6.27 MB/sec), 38.4 ms avg latency, 212.0 ms max latency.
292 records sent, 58.3 records/sec (5.69 MB/sec), 34.1 ms avg latency, 182.0 ms max latency.
8333 records sent, 55.070548 records/sec (5.38 MB/sec), 81.14 ms avg latency, 9574.00 ms max latency, 35 ms 50th, 195 ms 95th, 1164 ms 99th, 2027 ms 99.9th.